Revit 2027 API
BuiltInFailures.PipingFailures.MaxPipeSizeReached Property
 Maximum pipe size diameter reached during sizing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MaxPipeSizeReached { get; }
Public Shared ReadOnly Property MaxPipeSizeReached As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MaxPipeSizeReached {
	FailureDefinitionId^ get ();
}
static member MaxPipeSizeReached : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace